app/controllers/boards_controller.rb

INSERT INTO "boards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "woohoo"], ["created_at", 2017-02-04 00:00:53 UTC], ["updated_at", 2017-02-04 00:00:53 UTC]]
---
  def create
    @board = Board.new(board_params)
    @board.users << current_user

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_board
    @board = Board.find(params[:id])