app/controllers/lists_controller.rb

  def index
    @board = Board.find(params[:board_id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]